# 6. Реализовать функцию int_func(), принимающую слово из маленьких латинских букв и возвращающую его же,
# но с прописной первой буквой. Например, print(int_func(‘text’)) -> Text.
# !!!!Усложнение не понял, функция сразу работает на все введенные слова.!!!!
def int_func (word):
    print(word.title())
    return


int_func(input("Введите слово>>>"))

