# 1. Поработайте с переменными, создайте несколько, выведите на экран, запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.

Name = input("Введите имя >>>")
Surname = input("Введите фамилию >>>")
Edge = int(input("Введите возраст(полных лет)>>"))
Profession = input("Введите вашу проффессию >>>")
Experience = int(input("Стаж работы (полных лет)>>>"))
print(Name, Surname, "возраст", Edge, "лет", "проффесия", Profession, "стаж работы (полных лет)", Experience)
